#ifndef __RS485_H
#define __RS485_H

typedef void (*rs485_data_handler_t)(uint8_t *data, int size);

//初始化485总线
void rs485_init(void);

/**************************************************************************************************
* 485总线数据交换
*--------------------------------------------------------------------------------------------------
* 参数: addr    通信子地址
*       data    发送的数据
*       size    发送的数据长度
*       handler 接收到数据包的回调函数
*--------------------------------------------------------------------------------------------------
* 返回: true    成功
*       false   失败(接收数据超时)
**************************************************************************************************/
bool rs485_data_xfer(uint8_t addr, void *data, int size, rs485_data_handler_t handler);

#endif
